app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Bob_The_Sob"]]
SELECT "users".* FROM "users" WHERE (Bob_The_Sob)
---
  def index
    if params[:username]
      users = User.where("username ILIKE '%#{params[:username]}%'")
    else
      users = Users.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Marylyn"], ["email", "marylynclassclass@gmail.com"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "marylynclassyclass@gmail.com"], ["id", 3]]
---
  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)